# GS_EdSh_PopulateMenu

## Description
Adds menu items to a popup in an edit shader dialog.

```pascal
PROCEDURE GS_EdSh_PopulateMenu(
				itemID         : LONGINT;
				numStrings     : LONGINT;
				cStringsArray  : LONGINT;
				libraryDataPtr : LONGINT);
```

```python
def vs.GS_EdSh_PopulateMenu(itemID, numStrings, cStringsArray, libraryDataPtr):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|itemID|LONGINT|   |
|numStrings|LONGINT|   |
|cStringsArray|LONGINT|   |
|libraryDataPtr|LONGINT|   |

## Version
Availability: from Vectorworks 2014

## Category
* Textures